<a href="https://colab.research.google.com/github/Neel7317/Ensemble_Techniques/blob/main/Gradientboost_classifier.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [31]:
import pandas as pd
import numpy as np

In [32]:
df=pd.read_csv('titanic.csv')

In [33]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [34]:
X=df.drop(['Survived'],axis=1)
y=df['Survived']

In [35]:
from sklearn.model_selection import train_test_split

In [36]:
X_train,X_test,y_train,y_test=train_test_split(X,y,random_state=2,test_size=0.25)

In [37]:
from sklearn.ensemble import GradientBoostingClassifier

In [38]:
model=GradientBoostingClassifier(learning_rate=0.1,n_estimators=50,max_depth=8)

In [39]:
model.fit(X_train,y_train)

ValueError: ignored

In [40]:
df=df.drop(['Name','Ticket','Parch','Fare','SibSp','Cabin','Embarked'],axis=1)

In [41]:
df

     PassengerId  Survived  Pclass     Sex   Age
0              1         0       3    male  22.0
1              2         1       1  female  38.0
2              3         1       3  female  26.0
3              4         1       1  female  35.0
4              5         0       3    male  35.0
..           ...       ...     ...     ...   ...
886          887         0       2    male  27.0
887          888         1       1  female  19.0
888          889         0       3  female   NaN
889          890         1       1    male  26.0
890          891         0       3    male  32.0

[891 rows x 5 columns]

In [42]:
df['Age'].isnull().sum()

177

In [44]:
df

     PassengerId  Survived  Pclass     Sex   Age
0              1         0       3    male  22.0
1              2         1       1  female  38.0
2              3         1       3  female  26.0
3              4         1       1  female  35.0
4              5         0       3    male  35.0
..           ...       ...     ...     ...   ...
885          886         0       3  female  39.0
886          887         0       2    male  27.0
887          888         1       1  female  19.0
889          890         1       1    male  26.0
890          891         0       3    male  32.0

[714 rows x 5 columns]

In [45]:
df=df.dropna(axis=0)

In [46]:
df

     PassengerId  Survived  Pclass     Sex   Age
0              1         0       3    male  22.0
1              2         1       1  female  38.0
2              3         1       3  female  26.0
3              4         1       1  female  35.0
4              5         0       3    male  35.0
..           ...       ...     ...     ...   ...
885          886         0       3  female  39.0
886          887         0       2    male  27.0
887          888         1       1  female  19.0
889          890         1       1    male  26.0
890          891         0       3    male  32.0

[714 rows x 5 columns]

In [47]:
df['Age'].isnull().sum()

0

In [48]:
df.describe()

       PassengerId    Survived      Pclass         Age
count   714.000000  714.000000  714.000000  714.000000
mean    448.582633    0.406162    2.236695   29.699118
std     259.119524    0.491460    0.838250   14.526497
min       1.000000    0.000000    1.000000    0.420000
25%     222.250000    0.000000    1.000000   20.125000
50%     445.000000    0.000000    2.000000   28.000000
75%     677.750000    1.000000    3.000000   38.000000
max     891.000000    1.000000    3.000000   80.000000

In [49]:
df.Pclass.value_counts()

3    355
1    186
2    173
Name: Pclass, dtype: int64

In [50]:
df

     PassengerId  Survived  Pclass     Sex   Age
0              1         0       3    male  22.0
1              2         1       1  female  38.0
2              3         1       3  female  26.0
3              4         1       1  female  35.0
4              5         0       3    male  35.0
..           ...       ...     ...     ...   ...
885          886         0       3  female  39.0
886          887         0       2    male  27.0
887          888         1       1  female  19.0
889          890         1       1    male  26.0
890          891         0       3    male  32.0

[714 rows x 5 columns]

In [52]:
df= pd.get_dummies(df,columns=['Sex'])

In [53]:
df

     PassengerId  Survived  Pclass   Age  Sex_female  Sex_male
0              1         0       3  22.0           0         1
1              2         1       1  38.0           1         0
2              3         1       3  26.0           1         0
3              4         1       1  35.0           1         0
4              5         0       3  35.0           0         1
..           ...       ...     ...   ...         ...       ...
885          886         0       3  39.0           1         0
886          887         0       2  27.0           0         1
887          888         1       1  19.0           1         0
889          890         1       1  26.0           0         1
890          891         0       3  32.0           0         1

[714 rows x 6 columns]

In [54]:
X=df.drop(['Survived'],axis=1)

In [55]:
y=df['Survived']

In [56]:
X_train,X_test,y_train,y_test=train_test_split(X,y,random_state=2,test_size=0.25)

In [57]:
model=GradientBoostingClassifier(learning_rate=0.1,n_estimators=50,max_depth=8)

In [58]:
model.fit(X_train,y_train)

GradientBoostingClassifier(ccp_alpha=0.0, criterion='friedman_mse', init=None,
                           learning_rate=0.1, loss='deviance', max_depth=8,
                           max_features=None, max_leaf_nodes=None,
                           min_impurity_decrease=0.0, min_impurity_split=None,
                           min_samples_leaf=1, min_samples_split=2,
                           min_weight_fraction_leaf=0.0, n_estimators=50,
                           n_iter_no_change=None, presort='deprecated',
                           random_state=None, subsample=1.0, tol=0.0001,
                           validation_fraction=0.1, verbose=0,
                           warm_start=False)

In [59]:
y_pred=model.predict(X_test)

In [60]:
from sklearn.metrics import accuracy_score,classification_report

In [61]:
print(accuracy_score(y_test,y_pred))

0.8044692737430168

In [62]:
print(classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       0.85      0.85      0.85       116
           1       0.73      0.71      0.72        63

    accuracy                           0.80       179
   macro avg       0.79      0.78      0.78       179
weighted avg       0.80      0.80      0.80       179